---
kind: method
id: M:Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.IsDataCompleted
source: html/5d5c1f17-7c0e-3913-d39f-30cfe5002bd3.htm
---
# Autodesk.Revit.DB.Mechanical.ZoneEquipmentData.IsDataCompleted Method

Is the required data completed for this zone equipment?

## Syntax (C#)
```csharp
public bool IsDataCompleted()
```